package ru.otus.java.basic.homeworks.homework11;

public class Main {
    /*
    * Построение простейшего двоичного дерева и поиск по нему
    *
    * Написать программу делающую следующее
    * - Из Предварительно отсортированного списка (List) сформировать двоичное дерево поиска
    * - Написать рекурсивную функцию поиска в сформированном дереве
    */

    public static void main(String[] args) {
        System.out.println("Hello");
    }
}
