package ru.otus.java.basic.homeworks.homework10;

public class Main {
    /*
    - Реализуйте класс PhoneBook, который хранит в себе список имен (фио) и телефонных номеров;
    - Метод add() должен позволять добавлять запись имя-телефон;
    - Метод find() выполнять поиск номер(-а, -ов) телефона по имени;
    - Под одним именем может быть несколько телефонов (в случае однофамильцев, или наличии у одного человека нескольких номеров), тогда при запросе такой фамилии должны выводиться все телефоны;
    - Метод containsPhoneNumber должен проверять наличие телефона в справочнике.
     */

    public static void main(String[] args) {
        System.out.println("Hello");
    }
}